# Código de inicialización
Este código permite inicializar las bibliotecas para usar SQLite en la máquina virtual de Google Colab. El código además elimina cualquier dato almacenado anteriormente en el archvio `ejemplos.db`. Es recomendable volver a correr el código cada vez que se comience con la resolución de un nuevo ejercicio.

In [1]:
!pip install pymysql
%load_ext sql
!rm -rf ejemplos.db
%sql sqlite:///ejemplos.db

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 2.0 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

# EJERCICIOS DE GROUP y HAVING

## Ejercicio 1: Ventas por Ciudad de distintos insumos informáticos

Tienes dos tablas llamadas `Ventas` y `Productos`:

- La tabla `Ventas` tiene las siguientes columnas:
  - `VentaID` (INT)
  - `ProductoID` (INT, FOREIGN KEY que referencia a `Productos(ProductoID)`)
  - `CantidadVendida` (INT)
  - `PrecioUnitario` (DECIMAL)
  - `Ciudad` (VARCHAR)

- La tabla `Productos` tiene las siguientes columnas:
  - `ProductoID` (INT, PRIMARY KEY)
  - `NombreProducto` (VARCHAR)
  - `Precio` (DECIMAL)

Deseas analizar las ventas por ciudad, combinando la información de ambas tablas para mostrar el nombre de los productos vendidos y el total de ingresos generados por cada ciudad.

In [2]:
%%sql
CREATE TABLE Productos (
  ProductoID INT PRIMARY KEY,
  NombreProducto VARCHAR(255),
  Precio DECIMAL
);
CREATE TABLE Ventas (
  VentaID INT PRIMARY KEY,
  ProductoID INT,
  CantidadVendida INT,
  PrecioUnitario DECIMAL,
  Ciudad VARCHAR(255),
  FOREIGN KEY (ProductoID) REFERENCES Productos(ProductoID)
);

 * sqlite:///ejemplos.db
Done.
Done.

[]

**Rellenado de la tabla Ventas**

In [3]:
# Población de la tabla Ventas
# Insertar datos en la tabla Ventas
%%sql
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (5, 1, 6, 45.00, 'Buenos Aires');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (6, 12, 9, 35.00, 'Córdoba');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (7, 2, 4, 20.00, 'Rosario');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (8, 13, 12, 60.00, 'Mendoza');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (9, 3, 7, 55.00, 'La Plata');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (10, 3, 5, 32.50, 'San Miguel de Tucumán');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (11, 11, 3, 28.00, 'Salta');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (12, 11, 8, 40.00, 'Mar del Plata');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (13, 11, 11, 70.00, 'Santa Fe');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (14, 11, 4, 25.00, 'San Juan');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (15, 11, 9, 35.00, 'Neuquén');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (16, 11, 6, 45.00, 'Posadas');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (17, 13, 10, 50.00, 'Bahía Blanca');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (18, 11, 12, 65.00, 'San Salvador de Jujuy');
INSERT INTO Ventas (VentaID, ProductoID, CantidadVendida, PrecioUnitario, Ciudad) VALUES (19, 15, 3, 22.50, 'Comodoro Rivadavia');

INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (1, 'Teclado Mecánico', 75.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (2, 'Mouse Inalámbrico', 45.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (3, 'Monitor 24 Pulgadas', 150.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (4, 'Disco Duro SSD 1TB', 120.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (5, 'Memoria RAM 16GB', 80.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (6, 'Placa Madre ATX', 200.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (7, 'Tarjeta Gráfica 6GB', 350.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (8, 'Auriculares con Micrófono', 60.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (9, 'Cámara Web HD', 55.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (10, 'Micrófono de Condensador', 90.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (11, 'Router WiFi 6', 130.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (12, 'Impresora Láser', 180.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (13, 'Soporte Monitor Ajustable', 25.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (14, 'Teclado Inalámbrico', 50.00);
INSERT INTO Productos (ProductoID, NombreProducto, Precio) VALUES (15, 'Mouse Gaming', 40.00);

 * sqlite:///ejemplos.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el total de ingresos (`CantidadVendida * PrecioUnitario`) por cada ciudad.

In [11]:
%%sql
SELECT Ventas.ciudad, (CantidadVendida*PrecioUnitario) AS TotalIngresos
FROM Ventas
GROUP BY Ciudad
ORDER BY TotalIngresos DESC

 * sqlite:///ejemplos.db
Done.

[('San Salvador de Jujuy', 780),
 ('Santa Fe', 770),
 ('Mendoza', 720),
 ('Bahía Blanca', 500),
 ('La Plata', 385),
 ('Mar del Plata', 320),
 ('Neuquén', 315),
 ('Córdoba', 315),
 ('Posadas', 270),
 ('Buenos Aires', 270),
 ('San Miguel de Tucumán', 162.5),
 ('San Juan', 100),
 ('Salta', 84),
 ('Rosario', 80),
 ('Comodoro Rivadavia', 67.5)]

2. Escriba el código SQL para listar las Ciudades cuyo total de ingresos supera los $500.

In [38]:
%%sql
SELECT Ventas.ciudad, (CantidadVendida*PrecioUnitario) AS TotalIngresos
FROM Ventas
GROUP BY Ciudad
HAVING TotalIngresos > 500

 * sqlite:///ejemplos.db
Done.

[('Mendoza', 720), ('San Salvador de Jujuy', 780), ('Santa Fe', 770)]

3. Modifique la consulta del inciso 2 para ordenar las Ciudades de mayor a menor ingreso total.

In [39]:
%%sql
SELECT Ventas.ciudad, (CantidadVendida*PrecioUnitario) AS TotalIngresos
FROM Ventas
GROUP BY Ciudad
HAVING TotalIngresos > 500
ORDER BY TotalIngresos DESC

 * sqlite:///ejemplos.db
Done.

[('San Salvador de Jujuy', 780), ('Santa Fe', 770), ('Mendoza', 720)]

## Ejercicio 2: Promedio de Calificaciones por Curso

Considera las siguientes tres tablas:

- La tabla **Estudiantes** contiene información sobre los estudiantes inscritos:
  - `EstudianteID` (INT, PRIMARY KEY)
  - `Nombre` (VARCHAR)

- La tabla **Cursos** contiene información sobre los cursos disponibles:
  - `CursoID` (INT, PRIMARY KEY)
  - `NombreCurso` (VARCHAR)

- La tabla **Calificaciones** registra las notas de los estudiantes en los cursos:
  - `CalificacionID` (INT, PRIMARY KEY)
  - `EstudianteID` (INT, FOREIGN KEY que referencia a `Estudiantes(EstudianteID)`)
  - `CursoID` (INT, FOREIGN KEY que referencia a `Cursos(CursoID)`)
  - `Nota` (DECIMAL)

En este ejercicio, debes analizar el rendimiento de los estudiantes en cada curso, combinando la información de las tres tablas.

In [16]:
%%sql
CREATE TABLE Estudiantes(
  EstudianteID INT PRIMARY KEY,
  Nombre VARCHAR(255)
);
CREATE TABLE Cursos(
  CursoID INT PRIMARY KEY,
  NombreCurso VARCHAR(255)
);
CREATE TABLE Calificaciones(
  CalificacionID INT PRIMARY KEY,
  EstudianteID INT,
  CursoID INT,
  Nota DECIMAL,
  FOREIGN KEY (EstudianteID) REFERENCES Estudiantes (EstudianteID),
  FOREIGN KEY (CursoID) REFERENCES Cursos (CursoID)
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.

[]

**Población de la tabla Calificaciones**

In [17]:
# Insertar datos en la tabla Calificaciones
%%sql

INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1001, 'Carlos');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1002, 'Maria');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1003, 'Juan');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1004, 'Ana');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1005, 'Luis');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1006, 'Sofia');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1007, 'Diego');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1008, 'Laura');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1009, 'Javier');
INSERT INTO Estudiantes (EstudianteID, Nombre) VALUES (1010, 'Fernanda');

INSERT INTO Cursos (CursoID, NombreCurso) VALUES (201, 'Matemáticas');
INSERT INTO Cursos (CursoID, NombreCurso) VALUES (202, 'Historia');
INSERT INTO Cursos (CursoID, NombreCurso) VALUES (203, 'Ciencias');
INSERT INTO Cursos (CursoID, NombreCurso) VALUES (204, 'Literatura');
INSERT INTO Cursos (CursoID, NombreCurso) VALUES (205, 'Geografía');

INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (1, 1001, 201, 88.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (2, 1002, 202, 92.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (3, 1003, 201, 81.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (4, 1004, 203, 79.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (5, 1005, 202, 84.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (6, 1006, 204, 91.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (7, 1007, 205, 75.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (8, 1008, 204, 87.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (9, 1009, 203, 82.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (10, 1010, 205, 78.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (11, 1002, 201, 90.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (12, 1006, 202, 88.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (13, 1003, 203, 85.0);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (14, 1007, 201, 80.5);
INSERT INTO Calificaciones (CalificacionID, EstudianteID, CursoID, Nota) VALUES (15, 1005, 204, 89.5);

 * sqlite:///ejemplos.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el promedio de `Nota` para cada `Curso`.

In [20]:
%%sql
SELECT Cursos.NombreCurso, AVG(Calificaciones.Nota) AS PromedioNota
FROM Cursos
JOIN Calificaciones ON Cursos.CursoID = Calificaciones.CursoID
GROUP BY Cursos.NombreCurso

 * sqlite:///ejemplos.db
Done.

[('Ciencias', 82.33333333333333),
 ('Geografía', 76.75),
 ('Historia', 88.0),
 ('Literatura', 89.33333333333333),
 ('Matemáticas', 85.0)]

2. Escriba el código SQL para listar los cursos con un promedio mayor a 85.

In [24]:
%%sql
SELECT Cursos.NombreCurso, AVG(Calificaciones.Nota) AS PromedioNota
FROM Cursos
JOIN Calificaciones ON Cursos.CursoID = Calificaciones.CursoID
GROUP BY Cursos.NombreCurso
HAVING PromedioNota > 85

 * sqlite:///ejemplos.db
Done.

[('Historia', 88.0), ('Literatura', 89.33333333333333)]


3. Agregue una columna que muestre el número de estudiantes que han tomado cada curso cuyo promedio supera 85, ordenados en forma descendente por promedio.

In [25]:
%%sql
SELECT Cursos.NombreCurso, AVG(Calificaciones.Nota) AS PromedioNota, COUNT(DISTINCT Calificaciones.EstudianteID) AS NumeroEstudiantes
FROM Cursos
JOIN Calificaciones ON Cursos.CursoID = Calificaciones.CursoID
GROUP BY Cursos.NombreCurso
HAVING PromedioNota > 85
ORDER BY PromedioNota DESC

 * sqlite:///ejemplos.db
Done.

[('Literatura', 89.33333333333333, 3), ('Historia', 88.0, 3)]

## Ejercicio 3: Conteo de Empleados por Departamento

Tienes dos tablas llamadas `Empleados` y `Departamentos`:

- La tabla `Empleados` tiene las siguientes columnas:
  - `EmpleadoID` (INT)
  - `Nombre` (VARCHAR)
  - `DepartamentoID` (INT, FOREIGN KEY que referencia a `Departamentos(DepartamentoID)`)
  - `Salario` (DECIMAL)

- La tabla `Departamentos` tiene las siguientes columnas:
  - `DepartamentoID` (INT, PRIMARY KEY)
  - `NombreDepartamento` (VARCHAR)

Deseas analizar la distribución de empleados en cada departamento, combinando la información de ambas tablas para mostrar el nombre del departamento y el número de empleados por cada uno.

**Consignas a responder:**

In [26]:
%%sql
CREATE TABLE Departamentos (
  DepartamentoID INT PRIMARY KEY,
  NombreDepartamento VARCHAR(255)
);
CREATE TABLE Empleados (
  EmpleadoID INT PRIMARY KEY,
  Nombre VARCHAR(255),
  DepartamentoID INT,
  Salario DECIMAL,
  FOREIGN KEY (DepartamentoID) REFERENCES Departamentos (DepartamentoID)
);

 * sqlite:///ejemplos.db
Done.
Done.

[]

**Relleno de las tablas `Empleados` y `Departamentos`**

In [27]:
%%sql
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (5, 'Laura', 101, 3100);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (6, 'Javier', 104, 3300);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (7, 'Sofia', 105, 2900);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (8, 'Lucas', 105, 3700);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (9, 'Fernanda', 101, 3200);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (10, 'Diego', 104, 3400);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (11, 'Martina', 103, 4000);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (12, 'Gustavo', 105, 2950);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (13, 'Liliana', 106, 3800);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (14, 'Gabriel', 106, 4100);
INSERT INTO Empleados (EmpleadoID, Nombre, DepartamentoID, Salario) VALUES (15, 'Natalia', 102, 3600);

INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (101, 'Marketing');
INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (102, 'Ventas');
INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (103, 'Recursos Humanos');
INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (104, 'Desarrollo de Producto');
INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (105, 'Investigación de Mercado');
INSERT INTO Departamentos (DepartamentoID, NombreDepartamento) VALUES (106, 'Atención al Cliente');

 * sqlite:///ejemplos.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

**Consignas del ejercicio:**

1. Encuentre el número total de empleados en cada departamento.

In [29]:
%%sql
SELECT COUNT(Empleados.DepartamentoID) AS CantEmpoleadosPorDepartamento, Departamentos.NombreDepartamento
FROM Empleados
JOIN Departamentos ON Empleados.DepartamentoID = Departamentos.DepartamentoID
GROUP BY Empleados.DepartamentoID

 * sqlite:///ejemplos.db
Done.

[(2, 'Marketing'),
 (1, 'Ventas'),
 (1, 'Recursos Humanos'),
 (2, 'Desarrollo de Producto'),
 (3, 'Investigación de Mercado'),
 (2, 'Atención al Cliente')]

2. Escriba el código SQL para listar los departamentos que tienen más de 2 empleados.

In [30]:
%%sql
SELECT COUNT(Empleados.DepartamentoID) AS CantEmpoleadosPorDepartamento, Departamentos.NombreDepartamento
FROM Empleados
JOIN Departamentos ON Empleados.DepartamentoID = Departamentos.DepartamentoID
GROUP BY Empleados.DepartamentoID
HAVING CantEmpoleadosPorDepartamento > 2

 * sqlite:///ejemplos.db
Done.

[(3, 'Investigación de Mercado')]


3. Muestre el salario promedio de los empleados por cada departamento ordenados promedio en forma descendente.

In [37]:
%%sql
SELECT COUNT(Empleados.DepartamentoID) AS CantEmpoleadosPorDepartamento, Departamentos.NombreDepartamento, AVG(Empleados.Salario) AS SalarioPromedio
FROM Empleados
JOIN Departamentos ON Empleados.DepartamentoID = Departamentos.DepartamentoID
GROUP BY Empleados.DepartamentoID
ORDER BY SalarioPromedio DESC

 * sqlite:///ejemplos.db
Done.

[(1, 'Recursos Humanos', 4000.0),
 (2, 'Atención al Cliente', 3950.0),
 (1, 'Ventas', 3600.0),
 (2, 'Desarrollo de Producto', 3350.0),
 (3, 'Investigación de Mercado', 3183.3333333333335),
 (2, 'Marketing', 3150.0)]